; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	spectrograph0 - mode
	infrared1 - mode
	infrared2 - mode
	GroundStation1 - direction
	Star3 - direction
	Star6 - direction
	Star0 - direction
	Star7 - direction
	GroundStation8 - direction
	Star4 - direction
	Star5 - direction
	GroundStation2 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 infrared1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation8)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 infrared2)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star9)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
)
(:goal (and
	(pointing satellite0 Phenomenon16)
	(pointing satellite2 Star9)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 infrared1)
	(have_image Phenomenon14 spectrograph0)
	(have_image Planet15 infrared1)
	(have_image Phenomenon16 infrared2)
))

)

; plan
1. (turn_to satellite2 star9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star9)
   goals met: 1 of 8
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 8
3. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 8
4. (turn_to satellite0 planet10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet10)
   goals met: 1 of 8
5. (take_image satellite0 planet10 instrument2 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 2 of 8
6. (turn_to satellite0 phenomenon14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 8
7. (take_image satellite0 phenomenon14 instrument2 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 3 of 8
8. (turn_to satellite0 phenomenon11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 8
9. (take_image satellite0 phenomenon11 instrument2 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 4 of 8
10. (turn_to satellite0 planet15 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
11. (take_image satellite0 planet15 instrument2 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 5 of 8
12. (turn_to satellite0 star12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star12)
   goals met: 5 of 8
13. (take_image satellite0 star12 instrument2 infrared1)
   added: (have_image star12 infrared1)
   goals met: 6 of 8
14. (turn_to satellite0 phenomenon16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon16)
   goals met: 7 of 8
15. (take_image satellite0 phenomenon16 instrument2 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 8 of 8
